Revit 2026 API

# SpecUtilsIsValidDataType Method

---

Returns true if the given ForgeTypeId identifies a valid parameter data type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidDataType(
	ForgeTypeId dataType
)
```
```vb
Public Shared Function IsValidDataType (
	dataType As ForgeTypeId
) As Boolean
```
```cpp
public:
static bool IsValidDataType(
	ForgeTypeId^ dataType
)
```
```fsharp
static member IsValidDataType :
        dataType : ForgeTypeId -> bool
```

#### Parameters

dataType ForgeTypeId
     The identifier to check.

#### Return Value

Boolean True if the ForgeTypeId identifies either a spec or a category, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A ForgeTypeId is acceptable as a parameter data type if it identifies either a spec or a category. When a category identifier is used as a parameter data type, it indicates a Family Type parameter of that category.

#### Reference

SpecUtils Class

Autodesk.Revit.DB Namespace